# Set and modify the tenant whitelist

The tenant whitelist feature allows you to set the clients that are allowed to access the current tenant.

## Background

The tenant whitelist is a list of clients that are allowed to log on to this tenant and is specified by the `ob_tcp_invited_nodes` system variable. You can set the tenant whitelist based on your business requirements. IP addresses in the tenant whitelist can be specified in one of the following formats:

* Regular IP addresses. Example: `10.10.10.10,10.10.10.11`

* Subnet/mask. Example: `10.10.10.0/24`

* Fuzzy match. Example: `10.10.10.%` or `10.10.10._`

* Mixed format. Example: `10.10.10.10, 10.10.10.11, 10.10.10.%, 10.10.10._, 10.10.10.0/24`

## View the tenant whitelist

1. Log on to the database as a tenant administrator.

   ```shell
   obclient -h172.30.xx.xx -P2883 -uroot@mq_t1#cluster  -A
   ```

2. View the tenant whitelist.

   ```shell
   obclient> SHOW VARIABLES LIKE 'ob_tcp_invited_nodes';
   +----------------------+-------+
   | Variable_name        | Value |
   +----------------------+-------+
   | ob_tcp_invited_nodes | %     |
   +----------------------+-------+
   ```

## Modify the whitelist configuration of a tenant

You can modify the whitelist configuration of a tenant as the administrator of the sys tenant or the current tenant.

### Modify the tenant whitelist as the administrator of the sys tenant

1. Log on to the sys tenant of the cluster as the root user.

   ```shell
   obclient -h172.30.xx.xx -P2883 -uroot@mq_t1#cluster -p**** -A
   ```

2. Modify the whitelist configuration of the tenant.

   ```shell
   obclient> ALTER TENANT mq_t1 VARIABLES ob_tcp_invited_nodes = '10.10.10.%';
   ```

### Modify the whitelist configuration of a user tenant as its administrator

1. Log on to the database as a tenant administrator.

   ```shell
   obclient -h172.30.xx.xx -P2883 -uroot@mq_t1#cluster  -A
   ```

2. Modify the whitelist configuration of the tenant.

   ```shell
   obclient> SET GLOBAL ob_tcp_invited_nodes='10.10.10.%';
   ```

3. View the modification result.

   ```shell
   obclient> SHOW VARIABLES LIKE 'ob_tcp_invited_nodes';
   +----------------------+------------+
   | Variable_name        | Value      |
   +----------------------+------------+
   | ob_tcp_invited_nodes | 10.10.10.% |
   +----------------------+------------+
   ```
